Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Type inference in Swift operates at the level of a single expression or statement.
ja: スウィフトの型推論は、単一の式や文の水準で働きます。

source: Type inference is particularly useful when you declare a constant or variable with an initial value.
ja: あなたが最初の値で定数または変数を宣言するとき、型推論は特に役に立ちます。

source: Type methods and properties now use the static keyword as a declaration modifier.
ja: メソッドとプロパティは今ではstaticキーワードを宣言修飾子として使います。

source: Type methods are called with dot syntax, like instance methods.
ja: 型メソッドは、インスタンスメソッドの様に、ドット構文で呼ばれます。

source: Type methods are similar to class methods in Objective-C.
ja: 型メソッドは、Objective-Cにおけるクラスメソッドに似ています。

source: Type parameters specify and name a placeholder type, and are written immediately after the function’s name, between a pair of matching angle brackets (such as <T>).
ja: 型パラメータは、プレースホルダ型を指定して命名します、そして関数の名前の直後に一対の山形括弧の間で書かれます（例えば<T>）。

source: Type properties are discussed in Type Properties.
ja: 型プロパティは、型プロパティで議論されます。

source: Type properties are queried and set with dot syntax, just like instance properties.
ja: 型プロパティは、インスタンスプロパティのように、ドット構文で問い合わせられ設定されます。

source: Type properties are useful for defining values that are universal to all instances of a particular type, such as a constant property that all instances can use (like a static constant in C), or a variable property that stores a value that is global to all instances of that type (like a static variable in C).
ja: 型プロパティは、特定の型の全てのインスタンスに共通なさまざまな値を定義することに役立ちます、例えば、全てのインスタンスが使うことができる定数プロパティ（Cでの静的定数のように）、またはその型の全てのインスタンスにグローバルである値を格納する変数プロパティ（Cでの静的変数のように）。

source: Type safety helps you catch and fix errors as early as possible in the development process.
ja: 型安全は、あなたが開発プロセスにおいて可能な限り早期にエラーを捕まえて修復するのを助けます。

source: Type-Casting Operators
ja: 型キャスト演算子

source: Type-Casting Patterns
ja: 型キャスト・パターン

source: Type-checking helps you avoid errors when you’re working with different types of values.
ja: 型をチェックすることは、あなたが異なる種類の値を扱っているとき、あなたがエラーを避ける手助けをします。

source: Types
ja: 型

source: Types can be nested to as many levels as are required.
ja: 型は、必要とされるだけ多くの階層に入れ子にされることができます。

source: Types declared with the dynamicMemberLookup attribute include members that are looked up at runtime, as described in Attributes.
ja: dynamicMemberLookup属性とともに宣言される型は、実行時に捜されるメンバーを含みます、属性で記述されるように。

source: Types don’t automatically adopt a protocol just by satisfying its requirements.
ja: 型は、単にその要件を満たすことだけによっては自動的にあるプロトコルを採用しません。

source: Types like structures, tuples, and enumerations are made up of individual constituent values, such as the properties of a structure or the elements of a tuple.
ja: 構造体、タプル、そして列挙のようないくつかの型は、例えば構造体のプロパティやタプルの要素などのような個々の構成要素から作り上げられます。

source: Types that conform to the Hashable protocol must provide a gettable Int property called hashValue.
ja: Hashableプロトコルに適合する型は、取得可能なIntプロパティ、hashValueと呼ばれるものを提供しなければなりません。

source: Typically you don’t need to perform manual cleanup when your instances are deallocated.
ja: 概して、あなたのインスタンスが割り当て解除されるとき、あなたが手動で掃除をする必要がありません。

source: Typically, you use the if statement to evaluate simple conditions with only a few possible outcomes.
ja: 一般的に、あなたはif文をほんの２、３の起こりうる結果だけを持つ単純な状況を評価するために使います。

source: U+0000, U+0009, U+000B, U+000C, or U+0020
ja: U+0000, U+0009, U+000B, U+000C, または U+0020

source: U+000D followed by U+000A
ja: U+000D に続けて U+000A

source: U+00A8, U+00AA, U+00AD, U+00AF, U+00B2–U+00B5, or U+00B7–U+00BA
ja: U+00A8, U+00AA, U+00AD, U+00AF, U+00B2–U+00B5, または U+00B7–U+00BA

source: U+00BC–U+00BE, U+00C0–U+00D6, U+00D8–U+00F6, or U+00F8–U+00FF
ja: U+00BC–U+00BE, U+00C0–U+00D6, U+00D8–U+00F6, または U+00F8–U+00FF

source: U+0100–U+02FF, U+0370–U+167F, U+1681–U+180D, or U+180F–U+1DBF
ja: U+0100–U+02FF, U+0370–U+167F, U+1681–U+180D, または U+180F–U+1DBF

source: U+0300–U+036F, U+1DC0–U+1DFF, U+20D0–U+20FF, or U+FE20–U+FE2F
ja: U+0300–U+036F, U+1DC0–U+1DFF, U+20D0–U+20FF, または U+FE20–U+FE2F

source: U+10000–U+1FFFD, U+20000–U+2FFFD, U+30000–U+3FFFD, or U+40000–U+4FFFD
ja: U+10000–U+1FFFD, U+20000–U+2FFFD, U+30000–U+3FFFD, または U+40000–U+4FFFD

source: U+200B–U+200D, U+202A–U+202E, U+203F–U+2040, U+2054, or U+2060–U+206F
ja: U+200B–U+200D, U+202A–U+202E, U+203F–U+2040, U+2054, または U+2060–U+206F

source: U+2070–U+20CF, U+2100–U+218F, U+2460–U+24FF, or U+2776–U+2793
ja: U+2070–U+20CF, U+2100–U+218F, U+2460–U+24FF, または U+2776–U+2793

source: U+3004–U+3007, U+3021–U+302F, U+3031–U+303F, or U+3040–U+D7FF
ja: U+3004–U+3007, U+3021–U+302F, U+3031–U+303F, または U+3040–U+D7FF

source: U+50000–U+5FFFD, U+60000–U+6FFFD, U+70000–U+7FFFD, or U+80000–U+8FFFD
ja: U+50000–U+5FFFD, U+60000–U+6FFFD, U+70000–U+7FFFD, または U+80000–U+8FFFD

source: U+90000–U+9FFFD, U+A0000–U+AFFFD, U+B0000–U+BFFFD, or U+C0000–U+CFFFD
ja: U+90000–U+9FFFD, U+A0000–U+AFFFD, U+B0000–U+BFFFD, または U+C0000–U+CFFFD

source: U+D0000–U+DFFFD or U+E0000–U+EFFFD
ja: U+D0000–U+DFFFD または U+E0000–U+EFFFD

source: U+F900–U+FD3D, U+FD40–U+FDCF, U+FDF0–U+FE1F, or U+FE30–U+FE44
ja: U+F900–U+FD3D, U+FD40–U+FDCF, U+FDF0–U+FE1F, または U+FE30–U+FE44

source: UInt
ja: 符号なし整数（Unsigned Integer）

source: UTF-16 Representation
ja: UTF-16表現

source: UTF-8 Representation
ja: UTF-8表現

source: Unary prefix operators appear immediately before their target (such as !b), and unary postfix operators appear immediately after their target (such as c!).
ja: 単項接頭辞演算子はそれらの目標の直前に現れます（例えば!bのように）、そして単項接尾辞演算子はそれらの目標の直後に現れます（例えばc!のように）。

source: Unary Minus Operator
ja: 単項マイナス演算子

source: Unary Plus Operator
ja: 単項プラス演算子

source: Unary operators operate on a single target.
ja: 単項演算子は、１つの目標に作用します。

source: Underscores (_) are allowed between digits for readability, but they’re ignored and therefore don’t affect the value of the literal.
ja: アンダースコア（_）は、可読性のために桁の間で認められます、しかしそれらは無視されて、それゆえにリテラルの値に影響を及ぼしません。

source: Understanding Conflicting Access to Memory
ja: メモリへのアクセスの衝突を理解する

source: Unfortunately, linking these two instances creates a strong reference cycle between them.
ja: 残念なことに、これらの２つのインスタンスを結ぶことは、それらの間で強い参照循環をつくります。

source: Unfortunately, the HTMLElement class, as written above, creates a strong reference cycle between an HTMLElement instance and the closure used for its default asHTML value.
ja: 残念なことに、このHTMLElementクラスは、上で書かれるように、HTMLElementインスタンスとその省略時のasHTML値のために使われるクロージャとの間に強い参照循環をつくります。

source: Unicode
ja: ユニコード

source: Unicode Representations of Strings
ja: 文字列のユニコード表現

source: Unicode Scalar Representation
ja: ユニコード・スカラー表現

source: Unicode scalar (\u{n}), where n is a hexadecimal number that has one to eight digits
ja: ユニコード・スカラー（\u{n}）、ここでnは16進数で１から８桁を持ちます

source: Unicode scalars for regional indicator symbols can be combined in pairs to make a single Character value, such as this combination of REGIONAL INDICATOR SYMBOL LETTER U (U+1F1FA) and REGIONAL INDICATOR SYMBOL LETTER S (U+1F1F8):
ja: 地域標識記号のためのユニコード・スカラーは、単一のCharacter値を作るために２つ一組で組み合わされることが出来ます、例えばREGIONAL INDICATOR SYMBOL LETTER U（U+1F1FA）とREGIONAL INDICATOR SYMBOL LETTER S（U+1F1F8）の組み合わせのように：

source: Unless otherwise specified, the default access level is internal, as described in Default Access Levels.
ja: 特に明記しない限り、省略時のアクセス水準で記述されるように、省略時のアクセス水準は内部です。

source: Unless otherwise specified, the default inferred type of a floating-point literal is the Swift standard library type Double, which represents a 64-bit floating-point number.
ja: 特に明記しない限り、初期状態で推論されるリテラル浮動小数点の型は、スウィフト標準ライブラリ型Doubleです、それは、64ビットの浮動小数点数を表します。

source: Unless otherwise specified, the default inferred type of an integer literal is the Swift standard library type Int.
ja: 特に明記しない限り、初期状態で推論されるリテラル整数の型は、スウィフト標準ライブラリ型Intです。

source: Unless the value of integerToDescribe is in the list of known prime numbers, it is not matched by the first switch case at all.
ja: integerToDescribeの値が知っている素数のリストの中にある場合を除いて、それは最初のswitchケース節に適合することはまったくありません。

source: Unless you need to work with a specific size of integer, always use Int for integer values in your code.
ja: あなたが整数の特定のサイズを扱う必要がない限り、常に、あなたのコードの整数値のためにIntを使ってください。

source: Unlike public, the compiler doesn’t allow declarations marked with usableFromInline to be referenced by name in code outside the module, even though the declaration’s symbol is exported.
ja: publicとは違い、コンパイラはusableFromInlineで印される宣言に名前によってモジュール外部のコードにおいて参照されるのを許しません、宣言のシンボルがエクスポートされるとしてもです。

source: Unlike flip(_:), the value that protoFlip(_:) returns isn’t required to always have the same type—it just has to conform to the Shape protocol.
ja: flip(_:)とは違い、protoFlip(_:)が返す値は、常に同じ型を持つように要求されません — それは単にShapeプロトコルに準拠しなければならないだけです。

source: Unlike Boolean conditions, you can’t combine availability conditions using logical operators such as && and ||.
ja: ブール条件と違って、あなたは論理演算子例えば&&や||などを使って有効性条件を連結することはできません。

source: Unlike C, Swift allows multiple switch cases to consider the same value or values.
ja: Cと違って、スウィフトは複数のswitchケース節に、同じ値または複数の値について考慮させます。

source: Unlike Objective-C initializers, Swift initializers do not return a value.
ja: Objective-Cのイニシャライザと違って、スウィフトのイニシャライザは値を返しません。

source: Unlike a switch statement in C, this switch statement does not match both "a" and "A".
ja: Cでのswitch文と違って、このswitch文は"a"と"A"の両方に合うものを見つけるわけではありません。

source: Unlike a default initializer, the structure receives a memberwise initializer even if it has stored properties that don’t have default values.
ja: 省略時のイニシャライザと違って、構造体はメンバー関連イニシャライザを受け取ります、たとえそれが省略時の値を持たない格納プロパティを持つとしても。

source: Unlike a single-line string literal, a multiline string literal can contain unescaped double quotation marks ("), carriage returns, and line feeds.
ja: 単一行の文字列リテラルと違い、複数行の文字列リテラルはエスケープされていない二重引用符（"）、キャリッジリターン、そしてラインフィードを含むことが出来ません。

source: Unlike a subscript, however, the updateValue(_:forKey:) method returns the old value after performing an update.
ja: しかし、添え字とは違い、updateValue(_:forKey:)メソッドは更新を実行した後に古い値を返します。

source: Unlike a variable, the value of a constant can’t be changed after it’s set.
ja: 変数とは異なり、それが設定された後で定数の値は変更できません。

source: Unlike a weak reference, however, an unowned reference is used when the other instance has the same lifetime or a longer lifetime.
ja: しかしながら、弱い参照とは違い、非所有参照は他のインスタンスが同じ生涯またはより長い生涯を持つ場合に使われます。

source: Unlike an if statement, a guard statement always has an else clause—the code inside the else clause is executed if the condition is not true.
ja: if文と違って、guard文は常にelse節を持ちます—else節の内部のコードはその条件が真でないならば実行されます。

source: Unlike arithmetic operators in C, arithmetic operators in Swift do not overflow by default.
ja: Cでの算術演算子と違って、スウィフトの算術演算子は、初期状態ではオーバフローしません。

source: Unlike arrays, sets do not have an equivalent shorthand form.
ja: 配列とは違い、集合は相当する短縮形を持ちません。

source: Unlike classes and structures, enumeration types do not have an implicitly provided default initializer; all initializers must be declared explicitly.
ja: クラスや構造体と違って、列挙型には、暗黙のうちに提供される省略時のイニシャライザがありません；全てのイニシャライザは、明確に宣言されなければなりません。

source: Unlike exception handling in many languages—including Objective-C—error handling in Swift does not involve unwinding the call stack, a process that can be computationally expensive.
ja: 多くの言語 ― Objective-Cを含めて ― での例外処理と違い、スウィフトにおけるエラー処理はコールスタック、計算的に高くつく可能性がある処理、の巻き戻し（アンワインド）を必要としません。

source: Unlike instance methods, subscripts can be read-write or read-only.
ja: インスタンスメソッドと違って、添え字は読み書き用であるか読み出し専用であることができます。

source: Unlike items in an array, items in a dictionary do not have a specified order.
ja: 配列の中の項目と違って、辞書の中の項目には、指定された順番がありません。

source: Unlike lazy stored properties, global constants and variables do not need to be marked with the lazy modifier.
ja: 遅延格納プロパティと違って、グローバルな定数と変数はlazy修飾子で印付けされる必要がありません。

source: Unlike many other languages, Swift doesn’t require you to write a semicolon (;) after each statement in your code, although you can do so if you wish.
ja: 多くの他の言語とは異なり、スウィフトはあなたにあなたのコードにおいて各文の後にセミコロン（;）を書くことを要求しません、けれどもあなたが望むならば、あなたはそうできます。

source: Unlike multiline comments in C, multiline comments in Swift can be nested inside other multiline comments.
ja: Cでの複数行コメントと違って、スウィフトの複数行コメントは他の複数行コメント内部に入れ子にされることができます。

source: Unlike other programming languages, Swift doesn’t require you to create separate interface and implementation files for custom structures and classes.
ja: 他のプログラミング言語と違って、スウィフトはあなたにあつらえの構造体およびクラスのために別々のインタフェースおよび実装ファイルを作成することを要求しません。

source: Unlike returning a value whose type is a protocol type, opaque types preserve type identity—the compiler has access to the type information, but clients of the module don’t.
ja: それの型があるプロトコル型である値を返すのとは違い、不透明型は型同一性を保全します — コンパイラは型情報にアクセスします、しかしモジュールのクライアントはしません。

source: Unlike stored instance properties, you must always give stored type properties a default value.
ja: 格納インスタンスプロパティと違って、あなたは格納型プロパティに省略時の値を常に与えなければなりません。

source: Unlike stored named values and stored variable properties, the value of a computed named value or a computed property is not stored in memory.
ja: 格納される名前を付けられた値および格納変数プロパティと違って、計算される名前を付けられた値または計算プロパティの値は、メモリに格納されません。

source: Unlike structures and enumerations, classes have two kinds of initializers: designated initializers and convenience initializers, as described in Initialization.
ja: 構造体や列挙と違って、クラスは２種類のイニシャライザを持ちます：指定イニシャライザと便宜イニシャライザ、初期化で記述されるように。

source: Unlike structures, class instances don’t receive a default memberwise initializer.
ja: 構造体と違って、クラスインスタンスは、自動生成のメンバー関連イニシャライザを授けられません。

source: Unlike subclasses in Objective-C, Swift subclasses do not inherit their superclass initializers by default.
ja: Objective-Cでのサブクラスとは異なり、スウィフトのサブクラスは、特に何もしなくてもそれらのスーパークラスのイニシャライザを継承します。

source: Unlike that example, SmallNumber also supports writing those initial values as part of declaring the property.
ja: その例とは違い、SmallNumberは、それら初期値を書き込むこともプロパティの宣言の一部としてサポートします。

source: Unlike the arithmetic operators in C and Objective-C, the Swift arithmetic operators don’t allow values to overflow by default.
ja: CとObjective-Cの算術演算子と違って、スウィフトの算術演算子は、値がオーバフローするのを初期状態では許しません。

source: Unlike the assignment operator in C and Objective-C, the assignment operator in Swift does not itself return a value.
ja: CとObjective-Cの代入演算子と違って、スウィフトの代入演算子は、それ自身で値を返しません。

source: Unlike the cases in the first form, each case has an underlying value, called a raw value, of the same basic type.
ja: 最初の形式でのケース節と違って、それぞれのケース節は、同じ基本の型の、もととなる値、生の値と呼ばれるものを持ちます。

source: Unlike the condition of an if statement, the compilation condition is evaluated at compile time.
ja: if文の条件とは違い、compilation condition（コンパイル条件）はコンパイル時に評価されます。

source: Unlike the error conditions discussed in Error Handling above, assertions and preconditions aren’t used for recoverable or expected errors.
ja: 上のエラー処理で議論されるエラー条件とは違い、表明と前提条件は回復できるまたは予想されたエラーに対して使われません。

source: Unlike value types, reference types are not copied when they are assigned to a variable or constant, or when they are passed to a function.
ja: 値型とは異なり、参照型は、それが変数や定数に代入される時に、あるいはそれが関数に渡される時に、コピーされません。

source: Unowned References
ja: 非所有参照

source: Unowned References and Implicitly Unwrapped Optional Properties
ja: 非所有参照と暗黙的にアンラップされるオプショナルのプロパティ

source: Upcasting lets you use an expression as an instance of its type’s supertype, without using an intermediate variable.
ja: アップキャストは、あなたにある式をそれのスーパータイプのインスタンスとして使用させます、中間生成物の変数の使用なしに。

source: Updated Closures Are Reference Types to clarify the capturing rules for variables.
ja: クロージャは参照型ですを新しくして、変数に対するキャプチャ規則を明瞭にしました。

source: Updated Defining a Capture List to clarify the syntax for weak and unowned references in closure capture lists.
ja: 捕獲リストの定義を新しくして、クロージャ捕獲リスト内の弱いおよび非所有参照に対する構文を明瞭にしました。

source: Updated Operators to explicitly mention examples of supported characters for custom operators, such as those in the Mathematical Operators, Miscellaneous Symbols, and Dingbats Unicode blocks.
ja: 演算子を更新して、あつらえの演算子のためにサポートされる文字の例にはっきりと言及するようにしました、例えばMathematical Operators、Miscellaneous Symbols、そしてDingbatsユニコードブロックにおけるそれら。

source: Updated Protocol Declaration to clarify protocol declaration scope and members.
ja: プロトコル宣言を新しくして、プロトコル宣言スコープおよびメンバーを明瞭にしました。

source: Updated Range Operators to note that a half-open range with the same start and end index will be empty.
ja: 範囲演算子を新しくして、同じ開始および終止インデックスを持つ半開範囲が空になることを記しました。

source: Updated Value Overflow to clarify the overflow behavior of signed and unsigned integers
ja: 値オーバフローを新しくして、符号つき及び符号なし整数のオーバフロー挙動を明瞭にしました。

source: Updated a note in the Property Observers section to clarify the behavior of willSet and didSet observers.
ja: 節プロパティオブザーバーをwillSetとdidSetオブザーバーの挙動を理解しやすくするために更新した。

source: Updated a note in the Type Properties section to mention that stored type properties are lazily initialized.
ja: 型プロパティ節の注を更新して、格納型プロパティが遅延して初期化されることに言及した。

source: Updated and expanded the Comparing Strings section to reflect and demonstrate that string and character comparison and prefix / suffix comparison are now based on Unicode canonical equivalence of extended grapheme clusters.
ja: 節文字列を比較するを更新および拡張して、文字列および文字比較と接頭辞／接尾辞比較が今では拡張書記クラスタのユニコード正準等価に基づかれることを反映し例示しました。

source: Updated attribute arguments to use a colon in the Attributes chapter.
ja: 属性引数をコロンを使うように章属性において更新した。

source: Updated discussion throughout to use macOS instead of OS X, Error instead of ErrorProtocol, and protocol names such as ExpressibleByStringLiteral instead of StringLiteralConvertible.
ja: 解説を隅から隅まで更新してmacOSをOS Xの代わりに、ErrorをErrorProtocolの代わりに、ExpressibleByStringLiteralのようなプロトコル名をStringLiteralConvertibleの代わりに使うようにした。

source: Updated figures in the Weak References section to show the deallocation process more clearly.
ja: 弱い参照節の図を更新して、デアロケーション過程をより明瞭に見せるようにした。

source: Updated for Swift 1.1.
ja: Swift 1.1にふさわしく更新した。

source: Updated for Swift 1.2.
ja: Swift 1.2にふさわしく更新した。

source: Updated for Swift 2.0.
ja: Swift 2.0にふさわしく更新した。

source: Updated for Swift 2.1.
ja: Swift 2.1にふさわしく更新した。

source: Updated for Swift 2.2.
ja: Swift 2.2にふさわしく更新した。

source: Updated for Swift 3.0.
ja: Swift 3.0にふさわしく更新した。

source: Updated for Swift 3.0.1.
ja: Swift 3.0.1にふさわしく更新した。

source: Updated for Swift 3.1.
ja: Swift 3.1にふさわしく更新した。

source: Updated for Swift 4.0.
ja: Swift 4.0にふさわしく更新した。

source: Updated for Swift 4.0.3.
ja: Swift 4.0.3にふさわしく更新した。

source: Updated for Swift 4.1.
ja: Swift 4.1にふさわしく更新した。

source: Updated for Swift 4.2.
ja: Swift 4.2にふさわしく更新した。

source: Updated for Swift 5.0.
ja: Swift 5.0にふさわしく更新した。

source: Updated for Swift 5.1.
ja: Swift 5.1にふさわしく更新した。

source: Updated for Swift 5.2.
ja: Swift 5.2にふさわしく更新した。

source: Updated information about initializers that return nil before the instance is fully initialized in the Failable Initializers section.
ja: インスタンスが完全に初期化される前にnilを返すイニシャライザについての情報を失敗できるイニシャライザ節において更新した。

source: Updated the Accessing Properties Through Optional Chaining section to clarify how assignment through optional chaining behaves.
ja: オプショナル連鎖を通してプロパティにアクセスする節を更新して、オプショナル連鎖を通した割り当てがどのように振る舞うかを明確にした。

source: Updated the Accessing and Modifying a Dictionary section to note that Dictionary now has a Boolean isEmpty property.
ja: 辞書へのアクセスと修正の節を更新してDictionaryが今やブールのisEmptyプロパティを持つことを記しました。

source: Updated the Accessing and Modifying an Array section to note that you can no longer append a single item to an array with the += operator.
ja: 節配列へのアクセスと変更を更新して、あなたがもはや単一の項目を+=演算子を使って配列に加えることが出来ないことを注記しました。

source: Updated the Attributes chapter to note that the @IBAction, @IBOutlet, and @NSManaged attributes imply the @objc attribute.
ja: 属性の章を更新して、@IBAction、@IBOutlet、そして@NSManaged属性が@objc属性を暗示することを注記した。

source: Updated the Break Statement section with information about labeled break statements.
ja: 節ブレーク文をラベルをつけられたブレーク文についての情報で更新した。

source: Updated the Capturing Values section to clarify how variables and constants are captured in closures.
ja: 値を捕獲する節を更新してどのように変数と定数がクロージャにキャプチャされるかをわかりやすくした。

source: Updated the Concatenating Strings and Characters section to reflect the fact that String and Character values can no longer be combined with the addition operator (+) or addition assignment operator (+=).
ja: 文字列と文字の連結節をStringとCharacter値はもはや加算演算子（+）または加算代入演算子（+=）を使って結合されることができないという事実を反映するために更新しました。

source: Updated the Declaration Attributes and Conditional Compilation Block sections with information about tvOS.
ja: 宣言属性と条件コンパイルブロック節をtvOSについての情報で更新した。

source: Updated the Declaration Attributes section to describe when you can apply the @objc attribute to classes.
ja: 宣言属性節を更新してあなたが@objc属性をクラスへ適用できる場合を記述した。

source: Updated the Declaration Attributes section with information about the @available and @warn_unused_result attributes.
ja: 節宣言属性を@availableと@warn_unused_result属性についての情報で更新した。

source: Updated the Enumeration Case Pattern section, now that an enumeration case pattern can match an optional value.
ja: 列挙ケース節パターンの節を更新しました、今では列挙ケース節パターンはオプショナル値にマッチできるので。

source: Updated the Expressions chapter to separate the discussion of parenthesized expressions and tuple expressions.
ja: 式の章を更新して、括弧で囲まれた式とタプル式の解説を分離した。

source: Updated the Implicitly Unwrapped Optionals section to make it clearer that an implicitly unwrapped optional value can be used as either an optional or non-optional value.
ja: 暗黙的にアンラップされるオプショナルの節を更新した、暗黙的にアンラップされるオプショナル値がオプショナルまたは非オプショナル値のどちらとして使用できることをより明確にするため。

source: Updated the Initializer Inheritance and Overriding section to note that overrides of a designated initializer must now be marked with the override modifier.
ja: 節イニシャライザの継承とオーバーライドを更新して、指定イニシャライザのオーバーライドは今やoverride修飾子で印付けされなければならないことを注記しました。

source: Updated the Key-Path Expression section, now that key paths support subscript components.
ja: キーパス式の節を更新した、今ではキーパスは添え字を構成要素としてサポートします。

source: Updated the Memberwise Initializers for Structure Types section, now that memberwise initializers support omitting parameters for properties that have a default value.
ja: 構造体型のためのメンバー関連イニシャライザの節を更新しました、今ではメンバー関連イニシャライザは、省略時の値を持つプロパティに対してパラメータを省略することをサポートするので。

source: Updated the Operators section with discussion of custom operators that contain a dot.
ja: 演算子節をドットを含むカスタム演算子の議論で更新した。

source: Updated the Repeat-While section with information about the repeat-while loop.
ja: 節この間繰り返すをrepeat-whileループについての情報で更新した。

source: Updated the Representing and Throwing Errors section, now that all types can conform to the ErrorType protocol.
ja: エラーの表現とスロー節を更新した、現在ではすべての型がErrorTypeプロトコルに準拠できます。

source: Updated the Required Initializers section to note that the required modifier is now written before every subclass implementation of a required initializer, and that the requirements for required initializers can now be satisfied by automatically inherited initializers.
ja: 節必須イニシャライザを更新して、required修飾子が今やすべてのサブクラス実装の必須イニシャライザの前に書かれること、そして必須イニシャライザのための必要条件は今や自動的に継承されるイニシャライザで満たされることが出来るのを注記しました。

source: Updated the Self Type section, now that Self can be used to refer to the type introduced by the current class, structure, or enumeration declaration.
ja: Self型の節を加えました、今ではSelfは現在のクラス、構造体、または列挙宣言によって導入される型を参照するために使われることができるので。

source: Updated the Self Type section, now that the Self can be used in more contexts.
ja: Self型の節を更新した、今ではSelfはより多くの文脈で使われることができます。

source: Updated the Special Characters in String Literals section with a more precise definition of Unicode scalars.
ja: 節文字列リテラル内の特別な文字をユニコードスカラーのより精密な定義づけで更新した。

source: Updated the String Interpolation and String Literals sections now that string interpolations can contain string literals.
ja: 文字列補間と文字列リテラル節を更新した、今では文字列補間は文字列リテラルを含むことができます。

source: Updated the String Literals section to note that Unicode scalars inside string literals are now written as \u{n}, where n is a hexadecimal number between 0 and 10FFFF, the range of Unicode’s codespace.
ja: 文字列リテラルの節を更新して文字列内部のユニコード・スカラーが今や\u{n}のように書かれることを記しました、ここでnは０から10FFFまでの16進数、ユニコードの符号空間です。

source: Updated the Strings and Characters chapter to reflect the fact that Swift’s Character type now represents a single Unicode extended grapheme cluster.
ja: 文字列と文字の章を、スウィフトのCharacter型が今や単一のユニコード拡張書記素クラスタを表わすという事実を反映するために更新しました。
